src/cfe/МенеджерСинхронизаций/Enums/МС_ФорматОтветаAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>МС_ФорматОтветаAPI</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>JSON</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XML</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Enums/МС_HTTPМетодAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>МС_HTTPМетодAPI</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>GET</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>POST</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PUT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DELETE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PATCH</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HEAD</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OPTIONS</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Enums/МС_СпособПолученияДанныхAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>МС_СпособПолученияДанныхAPI</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТекстЗапроса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммныйМодуль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конструктор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Catalogs/МС_НастройкиAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МС_НастройкиAPI</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяШаблонаURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTTPМетод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_HTTPМетодAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолученияДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_СпособПолученияДанныхAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМетодаОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторТипИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_ТипИсточникаКонструктораAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторИмяТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторИмяТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторПоля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторОтборыJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОтвета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_ФорматОтветаAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JSONПараметрыЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособСопоставления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.МС_СпособСопоставленияПараметраОтбора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТестовыеЗначенияПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/CommonModules/МС_HTTPAPIСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Обработчик HTTP-запросов (все методы из шаблона URL).
//
Функция ОбработатьЗапрос(Запрос) Экспорт
	
	Попытка
		Возврат ОбработатьЗапросВнутр(Запрос);
	Исключение
		Инфо = ИнформацияОбОшибке();
		Текст = КраткоеПредставлениеОшибки(Инфо);
		Если СтрНайти(Текст, "Не передан обязательный параметр") > 0
			Или СтрНайти(Текст, "обязательный") > 0 Тогда
			Возврат ОтветОшибкиСервиса(400, Текст, Перечисления.МС_ФорматОтветаAPI.JSON, "");
		КонецЕсли;
		Возврат ОтветОшибкиСервиса(500, Текст, Перечисления.МС_ФорматОтветаAPI.JSON, "");
	КонецПопытки;
	
КонецФункции

// Выполняет настройку в форме (тест): те же шаги, что и HTTP, без объекта HTTP.
// Параметры подставляются из табличной части «Тестовые значения параметров API» (как строка запроса / тело при реальном вызове).
//
Функция ВыполнитьНастройкуВТестовомРежиме(СсылкаНастройки) Экспорт
	
	Попытка
		ДанныеНастройки = ДанныеНастройкиAPIПоСсылке(СсылкаНастройки);
		ПараметрыВнешние = ПараметрыДляТестаПоДаннымНастройки(ДанныеНастройки);
		РезультатДанных = ПолучитьДанныеПоНастройке(ДанныеНастройки, ПараметрыВнешние, "", Новый Соответствие);
		Тело = СериализоватьДанные(ДанныеНастройки, РезультатДанных);
		Возврат Тело;
	Исключение
		Возврат "Ошибка: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецФункции

// Формирует пример тела ответа без полного теста данных (пустые параметры, ограниченная выборка).
//
Функция СформироватьПримерОтвета(СсылкаНастройки) Экспорт
	
	Попытка
		ДанныеНастройки = ДанныеНастройкиAPIПоСсылке(СсылкаНастройки);
		ПараметрыВнешние = Новый Соответствие;
		РезультатДанных = ПолучитьДанныеПоНастройке(ДанныеНастройки, ПараметрыВнешние, "", Новый Соответствие);
		Тело = СериализоватьДанные(ДанныеНастройки, РезультатДанных);
		Возврат Тело;
	Исключение
		Возврат "Ошибка примера: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецФункции

// Возвращает уникальные имена параметров вида &Имя из текста запроса (язык запросов 1С).
//
Функция ИменаПараметровТекстаЗапроса(Знач ТекстЗапроса) Экспорт
	
	Результат = Новый Массив;
	Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда
		Возврат Результат;
	КонецЕсли;
	
	УжеДобавлены = Новый Соответствие;
	ДлинаТекста = СтрДлина(ТекстЗапроса);
	Позиция = 1;
	Пока Позиция <= ДлинаТекста Цикл
		ПозАмперсанда = СтрНайти(ТекстЗапроса, "&", , Позиция);
		Если ПозАмперсанда = 0 Тогда
			Прервать;
		КонецЕсли;
		ИмяПараметра = ИзвлечьИмяПараметраЗапросаИзТекста(ТекстЗапроса, ПозАмперсанда + 1, ДлинаТекста);
		Если ЗначениеЗаполнено(ИмяПараметра) Тогда
			Если УжеДобавлены.Получить(ИмяПараметра) = Неопределено Тогда
				УжеДобавлены.Вставить(ИмяПараметра, Истина);
				Результат.Добавить(ИмяПараметра);
			КонецЕсли;
			Позиция = ПозАмперсанда + 1 + СтрДлина(ИмяПараметра);
		Иначе
			Позиция = ПозАмперсанда + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что имена в табличной части «Параметры API» совпадают с параметрами &Имя в тексте.
//
Процедура ПроверитьСоответствиеПараметровИТекстаЗапроса(Знач ТекстЗапроса, ПараметрыЗапроса) Экспорт
	
	ИменаВТексте = ИменаПараметровТекстаЗапроса(ТекстЗапроса);
	ИспользуетсяВТексте = Новый Соответствие;
	Для Каждого Имя Из ИменаВТексте Цикл
		ИспользуетсяВТексте.Вставить(Имя, Истина);
	КонецЦикла;
	
	ОписаноВТаблице = Новый Соответствие;
	Для Каждого СтрокаПараметра Из ПараметрыЗапроса Цикл
		Имя = СокрЛП(СтрокаПараметра.ИмяПараметра);
		Если ЗначениеЗаполнено(Имя) Тогда
			ОписаноВТаблице.Вставить(Имя, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Имя Из ИменаВТексте Цикл
		Если Имя = "ЛимитСтрок" Тогда
			Продолжить;
		КонецЕсли;
		Если ОписаноВТаблице.Получить(Имя) = Неопределено Тогда
			ВызватьИсключение "В тексте запроса используется параметр """ + Имя
				+ """, но он не описан в табличной части «Параметры API».";
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаПараметра Из ПараметрыЗапроса Цикл
		Имя = СокрЛП(СтрокаПараметра.ИмяПараметра);
		Если Не ЗначениеЗаполнено(Имя) Тогда
			Продолжить;
		КонецЕсли;
		Если Имя = "ЛимитСтрок" Тогда
			Продолжить;
		КонецЕсли;
		Если ИспользуетсяВТексте.Получить(Имя) = Неопределено Тогда
			ВызватьИсключение "В табличной части «Параметры API» указан параметр """ + Имя
				+ """, но в тексте запроса он не встречается (ожидается &" + Имя + ").";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Выравнивает табличную часть тестовых значений с именами из «Параметры запроса»; сохраняет уже введённые значения.
//
Процедура СинхронизироватьТестовыеЗначенияСПараметрамиЗапроса(ОбъектНастройки) Экспорт
	
	Сохраненные = Новый Соответствие;
	Для Каждого Стр Из ОбъектНастройки.ТестовыеЗначенияПараметров Цикл
		Имя = СокрЛП(Стр.ИмяПараметра);
		Если ЗначениеЗаполнено(Имя) Тогда
			Сохраненные.Вставить(Имя, Стр.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ОбъектНастройки.ТестовыеЗначенияПараметров.Очистить();
	Для Каждого СтрП Из ОбъектНастройки.ПараметрыЗапроса Цикл
		Имя = СокрЛП(СтрП.ИмяПараметра);
		Если Не ЗначениеЗаполнено(Имя) Тогда
			Продолжить;
		КонецЕсли;
		Новая = ОбъектНастройки.ТестовыеЗначенияПараметров.Добавить();
		Новая.ИмяПараметра = Имя;
		Если Сохраненные.Получить(Имя) <> Неопределено Тогда
			Новая.Значение = Сохраненные.Получить(Имя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет описание параметров API по отборам конструктора (после записи JSON в объект).
//
Процедура ЗаполнитьПараметрыЗапросаИзОтборовКонструктораПоJSON(ОбъектНастройки) Экспорт
	
	СтарыеПараметры = СохранитьСтарыеПараметрыAPIПоИмени(ОбъектНастройки);
	
	ОбъектНастройки.ПараметрыЗапроса.Очистить();
	Если Не ЗначениеЗаполнено(ОбъектНастройки.КонструкторОтборыJSON) Тогда
		СинхронизироватьТестовыеЗначенияСПараметрамиЗапроса(ОбъектНастройки);
		Возврат;
	КонецЕсли;
	Попытка
		Отборы = JSONВЗначение(ОбъектНастройки.КонструкторОтборыJSON);
	Исключение
		СинхронизироватьТестовыеЗначенияСПараметрамиЗапроса(ОбъектНастройки);
		Возврат;
	КонецПопытки;
	Если ТипЗнч(Отборы) <> Тип("Массив") Тогда
		СинхронизироватьТестовыеЗначенияСПараметрамиЗапроса(ОбъектНастройки);
		Возврат;
	КонецЕсли;
	
	Уже = Новый Соответствие;
	Для Каждого ЭлементОтбора Из Отборы Цикл
		Если ТипЗнч(ЭлементОтбора) <> Тип("Соответствие") И ТипЗнч(ЭлементОтбора) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		ИмяПараметра = ЗначениеКлючаJSON(ЭлементОтбора, "ИмяПараметра");
		Если Не ЗначениеЗаполнено(ИмяПараметра) Тогда
			Продолжить;
		КонецЕсли;
		ИмяПараметра = СокрЛП(Строка(ИмяПараметра));
		Если Уже.Получить(ИмяПараметра) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Уже.Вставить(ИмяПараметра, Истина);
		СтрокаП = ОбъектНастройки.ПараметрыЗапроса.Добавить();
		СтрокаП.ИмяПараметра = ИмяПараметра;
		СтрокаП.Обязательный = Ложь;
		ПолеОтбора = ЗначениеКлючаJSON(ЭлементОтбора, "Поле");
		Если ЗначениеЗаполнено(ПолеОтбора) Тогда
			СтрокаП.Описание = "Отбор: " + Строка(ПолеОтбора);
		КонецЕсли;
		Если ЗначениеЗаполнено(ПолеОтбора) И ЗначениеЗаполнено(ОбъектНастройки.КонструкторИмяТаблицы) Тогда
			ОТ = МС_HTTPAPIКонструкторСервер.ПолучитьОписаниеТипаПоляТаблицы(ОбъектНастройки.КонструкторИмяТаблицы, Строка(ПолеОтбора));
			СтрокаП.ТипПараметра = МС_HTTPAPIКонструкторСервер.КраткоеИмяТипаПараметраAPI(ОТ);
			СтрокаП.СпособСопоставления = МС_HTTPAPIКонструкторСервер.СпособСопоставленияПараметраОтбораПоУмолчанию(ОТ);
		КонецЕсли;
		ВосстановитьСтрокуПараметраAPIИзСохраненных(СтрокаП, СтарыеПараметры);
	КонецЦикла;
	
	СинхронизироватьТестовыеЗначенияСПараметрамиЗапроса(ОбъектНастройки);
	
КонецПроцедуры

// Заполняет описание параметров API по таблице отборов мастера конструктора (без сохранения элемента).
//
Процедура ЗаполнитьПараметрыЗапросаИзТаблицыОтборовКонструктора(ОбъектНастройки, ОтборыКонструктора) Экспорт
	
	СтарыеПараметры = СохранитьСтарыеПараметрыAPIПоИмени(ОбъектНастройки);
	
	ОбъектНастройки.ПараметрыЗапроса.Очистить();
	Уже = Новый Соответствие;
	Для Каждого Стр Из ОтборыКонструктора Цикл
		Если Не ЗначениеЗаполнено(Стр.ИмяПараметра) Тогда
			Продолжить;
		КонецЕсли;
		Имя = СокрЛП(Стр.ИмяПараметра);
		Если Уже.Получить(Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Уже.Вставить(Имя, Истина);
		СтрокаП = ОбъектНастройки.ПараметрыЗапроса.Добавить();
		СтрокаП.ИмяПараметра = Имя;
		СтрокаП.Обязательный = Ложь;
		Если ЗначениеЗаполнено(Стр.Поле) Тогда
			СтрокаП.Описание = "Отбор: " + СокрЛП(Стр.Поле);
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.Поле) Тогда
			ИмяТаблицы = ОбъектНастройки.КонструкторИмяТаблицы;
			Если ЗначениеЗаполнено(ИмяТаблицы) Тогда
				ОТ = МС_HTTPAPIКонструкторСервер.ПолучитьОписаниеТипаПоляТаблицы(ИмяТаблицы, СокрЛП(Стр.Поле));
				СтрокаП.ТипПараметра = МС_HTTPAPIКонструкторСервер.КраткоеИмяТипаПараметраAPI(ОТ);
				СтрокаП.СпособСопоставления = МС_HTTPAPIКонструкторСервер.СпособСопоставленияПараметраОтбораПоУмолчанию(ОТ);
			КонецЕсли;
		КонецЕсли;
		ВосстановитьСтрокуПараметраAPIИзСохраненных(СтрокаП, СтарыеПараметры);
	КонецЦикла;
	
	СинхронизироватьТестовыеЗначенияСПараметрамиЗапроса(ОбъектНастройки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СохранитьСтарыеПараметрыAPIПоИмени(ОбъектНастройки)
	
	Результат = Новый Соответствие;
	Для Каждого Стр Из ОбъектНастройки.ПараметрыЗапроса Цикл
		Имя = СокрЛП(Стр.ИмяПараметра);
		Если Не ЗначениеЗаполнено(Имя) Тогда
			Продолжить;
		КонецЕсли;
		Результат.Вставить(Имя, Новый Структура("Обязательный, ТипПараметра, Источник, СпособСопоставления", Стр.Обязательный, Стр.ТипПараметра, Стр.Источник, Стр.СпособСопоставления));
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Процедура ВосстановитьСтрокуПараметраAPIИзСохраненных(СтрокаП, СтарыеПоИмени)
	
	Старое = СтарыеПоИмени.Получить(СокрЛП(СтрокаП.ИмяПараметра));
	Если Старое = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрокаП.Обязательный = Старое.Обязательный;
	Если ЗначениеЗаполнено(Старое.Источник) Тогда
		СтрокаП.Источник = Старое.Источник;
	КонецЕсли;
	// Тип из метаданных (строка выше) имеет приоритет; подставляем сохранённый тип только если тип ещё не определён.
	Если ЗначениеЗаполнено(Старое.ТипПараметра) И Не ЗначениеЗаполнено(СтрокаП.ТипПараметра) Тогда
		СтрокаП.ТипПараметра = Старое.ТипПараметра;
	КонецЕсли;
	ЗначСпособ = Неопределено;
	Если Старое.Свойство("СпособСопоставления", ЗначСпособ) И ЗначениеЗаполнено(ЗначСпособ) Тогда
		СтрокаП.СпособСопоставления = ЗначСпособ;
	КонецЕсли;
	
КонецПроцедуры

Функция ИзвлечьИмяПараметраЗапросаИзТекста(Текст, НачальнаяПозиция, ДлинаТекста)
	
	Если НачальнаяПозиция > ДлинаТекста Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не СимволДопустимВИмениПараметраЗапроса(Сред(Текст, НачальнаяПозиция, 1), Истина) Тогда
		Возврат "";
	КонецЕсли;
	
	КонецПозиции = НачальнаяПозиция;
	Пока КонецПозиции <= ДлинаТекста Цикл
		Символ = Сред(Текст, КонецПозиции, 1);
		Если СимволДопустимВИмениПараметраЗапроса(Символ, Ложь) Тогда
			КонецПозиции = КонецПозиции + 1;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Сред(Текст, НачальнаяПозиция, КонецПозиции - НачальнаяПозиция);
	
КонецФункции

Функция СимволДопустимВИмениПараметраЗапроса(Символ, ЭтоПервый)
	
	Код = КодСимвола(Символ);
	Если ЭтоПервый И Код >= 48 И Код <= 57 Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Код >= 48 И Код <= 57 Тогда
		Возврат Истина;
	КонецЕсли;
	Если Код >= 65 И Код <= 90 Тогда
		Возврат Истина;
	КонецЕсли;
	Если Код >= 97 И Код <= 122 Тогда
		Возврат Истина;
	КонецЕсли;
	Если Код = 95 Тогда
		Возврат Истина;
	КонецЕсли;
	Если Код >= 1040 И Код <= 1103 Тогда
		Возврат Истина;
	КонецЕсли;
	Если Код = 1025 Или Код = 1105 Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

Функция ЗначениеКлючаJSON(Объект, ИмяКлюча)
	
	Если ТипЗнч(Объект) = Тип("Структура") Тогда
		Если Объект.Свойство(ИмяКлюча) Тогда
			Возврат Объект[ИмяКлюча];
		КонецЕсли;
	ИначеЕсли ТипЗнч(Объект) = Тип("Соответствие") Тогда
		Возврат Объект.Получить(ИмяКлюча);
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

Функция ОбработатьЗапросВнутр(Запрос)
	
	МетодHTTP = "";
	Попытка
		МетодHTTP = ВРег(СокрЛП(Запрос.Метод));
	Исключение
		МетодHTTP = ВРег(СокрЛП(Запрос.HTTPМетод));
	КонецПопытки;
	ПараметрыURL = Запрос.ПараметрыURL;
	Версия = "";
	Шаблон = "";
	Если ПараметрыURL <> Неопределено Тогда
		Для Каждого КлючЗначение Из ПараметрыURL Цикл
			Если ВРег(КлючЗначение.Ключ) = "ВЕРСИЯ" Или КлючЗначение.Ключ = "Версия" Тогда
				Версия = КлючЗначение.Значение;
			ИначеЕсли ВРег(КлючЗначение.Ключ) = "ШАБЛОН" Или КлючЗначение.Ключ = "Шаблон" Тогда
				Шаблон = КлючЗначение.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Версия) Или Не ЗначениеЗаполнено(Шаблон) Тогда
		РазобратьВерсиюИШаблонИзURL(Запрос.ОтносительныйURL, Версия, Шаблон);
	КонецЕсли;
	
	ХвостПути = ИзвлечьХвостПути(Запрос.ОтносительныйURL, Версия, Шаблон);
	
	НастройкаСсылка = НайтиНастройкуAPI(Версия, Шаблон, МетодHTTP);
	Если НастройкаСсылка.Пустая() Тогда
		Возврат ОтветОшибкиСервиса(404, "Настройка API не найдена", Перечисления.МС_ФорматОтветаAPI.JSON, "");
	КонецЕсли;
	
	ДанныеНастройки = ДанныеНастройкиAPIПоСсылке(НастройкаСсылка);
	Если Не ДанныеНастройки.Активно Тогда
		Возврат ОтветОшибкиСервиса(503, "Сервис временно недоступен", ДанныеНастройки.ФорматОтвета, ДанныеНастройки.ВерсияAPI);
	КонецЕсли;
	
	ПараметрыВнешние = СобратьПараметрыИзHTTPЗапроса(Запрос);
	ПроверитьОбязательныеПараметры(ДанныеНастройки, ПараметрыВнешние);
	
	РезультатДанных = ПолучитьДанныеПоНастройке(ДанныеНастройки, ПараметрыВнешние, ХвостПути, Запрос.ПараметрыЗапроса);
	Тело = СериализоватьДанные(ДанныеНастройки, РезультатДанных);
	
	Ответ = Новый HTTPСервисОтвет(200);
	УстановитьЗаголовкиОтвета(Ответ, ДанныеНастройки);
	Ответ.УстановитьТелоИзСтроки(Тело, КодировкаТекста.UTF8);
	
	Возврат Ответ;
	
КонецФункции

Процедура РазобратьВерсиюИШаблонИзURL(ОтносительныйURL, Версия, Шаблон)
	
	СтрокаПути = ОтносительныйURL;
	ПозицияВопрос = СтрНайти(СтрокаПути, "?");
	Если ПозицияВопрос > 0 Тогда
		СтрокаПути = Лев(СтрокаПути, ПозицияВопрос - 1);
	КонецЕсли;
	
	Части = СтрРазделить(СтрокаПути, "/", Ложь);
	Индекс = 0;
	Для Каждого Часть Из Части Цикл
		Индекс = Индекс + 1;
		Если Индекс = 2 Тогда
			Версия = Часть;
		ИначеЕсли Индекс = 3 Тогда
			Шаблон = Часть;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ИзвлечьХвостПути(ОтносительныйURL, Версия, Шаблон)
	
	Если Не ЗначениеЗаполнено(ОтносительныйURL) Тогда
		Возврат "";
	КонецЕсли;
	СтрокаПути = ОтносительныйURL;
	ПозицияВопрос = СтрНайти(СтрокаПути, "?");
	Если ПозицияВопрос > 0 Тогда
		СтрокаПути = Лев(СтрокаПути, ПозицияВопрос - 1);
	КонецЕсли;
	
	Префикс = "/" + Версия + "/" + Шаблон;
	Если СтрНачинаетсяС(СтрокаПути, Префикс + "/") Тогда
		Возврат Сред(СтрокаПути, СтрДлина(Префикс) + 2);
	ИначеЕсли СтрокаПути = Префикс Или СтрокаПути = Сред(Префикс, 2) Тогда
		Возврат "";
	КонецЕсли;
	
	// Альтернативный разбор: всё после третьего сегмента
	Части = СтрРазделить(СтрокаПути, "/", Ложь);
	Если Части.Количество() > 3 Тогда
		Хвост = "";
		Для Инд = 4 По Части.Количество() Цикл
			Хвост = Хвост + ?(ЗначениеЗаполнено(Хвост), "/", "") + Части[Инд - 1];
		КонецЦикла;
		Возврат Хвост;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПеречислениеHTTPМетодПоСтроке(Знач Текст)
	
	Текст = ВРег(СокрЛП(Строка(Текст)));
	Если Текст = "GET" Тогда
		Возврат Перечисления.МС_HTTPМетодAPI.GET;
	ИначеЕсли Текст = "POST" Тогда
		Возврат Перечисления.МС_HTTPМетодAPI.POST;
	ИначеЕсли Текст = "PUT" Тогда
		Возврат Перечисления.МС_HTTPМетодAPI.PUT;
	ИначеЕсли Текст = "DELETE" Тогда
		Возврат Перечисления.МС_HTTPМетодAPI.DELETE;
	ИначеЕсли Текст = "PATCH" Тогда
		Возврат Перечисления.МС_HTTPМетодAPI.PATCH;
	ИначеЕсли Текст = "HEAD" Тогда
		Возврат Перечисления.МС_HTTPМетодAPI.HEAD;
	ИначеЕсли Текст = "OPTIONS" Тогда
		Возврат Перечисления.МС_HTTPМетодAPI.OPTIONS;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция НайтиНастройкуAPI(Знач Версия, Знач ИмяШаблона, Знач МетодHTTP)
	
	МетодПеречисление = ПеречислениеHTTPМетодПоСтроке(МетодHTTP);
	Если МетодПеречисление = Неопределено Тогда
		Возврат Справочники.МС_НастройкиAPI.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МС_НастройкиAPI.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.МС_НастройкиAPI КАК МС_НастройкиAPI
	|ГДЕ
	|	НЕ МС_НастройкиAPI.ПометкаУдаления
	|	И ВРЕГ(МС_НастройкиAPI.ВерсияAPI) = &Версия
	|	И ВРЕГ(МС_НастройкиAPI.ИмяШаблонаURL) = &ИмяШаблона
	|	И МС_НастройкиAPI.HTTPМетод = &Метод";
	
	Запрос.УстановитьПараметр("Версия", ВРег(СокрЛП(Версия)));
	Запрос.УстановитьПараметр("ИмяШаблона", ВРег(СокрЛП(ИмяШаблона)));
	Запрос.УстановитьПараметр("Метод", МетодПеречисление);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.МС_НастройкиAPI.ПустаяСсылка();
	
КонецФункции

// Снимок полей настройки API для выполнения запроса без загрузки объекта справочника (без блокировки на запись).
//
Функция ДанныеНастройкиAPIПоСсылке(СсылкаНастройки)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МС_НастройкиAPI.Активно КАК Активно,
	|	МС_НастройкиAPI.ВерсияAPI КАК ВерсияAPI,
	|	МС_НастройкиAPI.ФорматОтвета КАК ФорматОтвета,
	|	МС_НастройкиAPI.JSONПараметрыЗаписи КАК JSONПараметрыЗаписи,
	|	МС_НастройкиAPI.СпособПолученияДанных КАК СпособПолученияДанных,
	|	МС_НастройкиAPI.ТекстЗапроса КАК ТекстЗапроса,
	|	МС_НастройкиAPI.ИмяМетодаОбработчика КАК ИмяМетодаОбработчика,
	|	МС_НастройкиAPI.ЛимитСтрок КАК ЛимитСтрок,
	|	МС_НастройкиAPI.КонструкторИмяТаблицы КАК КонструкторИмяТаблицы,
	|	МС_НастройкиAPI.КонструкторПоля КАК КонструкторПоля,
	|	МС_НастройкиAPI.КонструкторОтборыJSON КАК КонструкторОтборыJSON
	|ИЗ
	|	Справочник.МС_НастройкиAPI КАК МС_НастройкиAPI
	|ГДЕ
	|	МС_НастройкиAPI.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаНастройки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		ВызватьИсключение "Не удалось прочитать настройку API по ссылке";
	КонецЕсли;
	
	Данные = Новый Структура;
	Данные.Вставить("Активно", Выборка.Активно);
	Данные.Вставить("ВерсияAPI", Выборка.ВерсияAPI);
	Данные.Вставить("ФорматОтвета", Выборка.ФорматОтвета);
	Данные.Вставить("JSONПараметрыЗаписи", Выборка.JSONПараметрыЗаписи);
	Данные.Вставить("СпособПолученияДанных", Выборка.СпособПолученияДанных);
	Данные.Вставить("ТекстЗапроса", Выборка.ТекстЗапроса);
	Данные.Вставить("ИмяМетодаОбработчика", Выборка.ИмяМетодаОбработчика);
	Данные.Вставить("ЛимитСтрок", Выборка.ЛимитСтрок);
	Данные.Вставить("КонструкторИмяТаблицы", Выборка.КонструкторИмяТаблицы);
	Данные.Вставить("КонструкторПоля", Выборка.КонструкторПоля);
	Данные.Вставить("КонструкторОтборыJSON", Выборка.КонструкторОтборыJSON);
	
	ЗапросПЗ = Новый Запрос;
	ЗапросПЗ.Текст =
	"ВЫБРАТЬ
	|	МС_НастройкиAPIПараметрыЗапроса.ИмяПараметра КАК ИмяПараметра,
	|	МС_НастройкиAPIПараметрыЗапроса.Обязательный КАК Обязательный,
	|	МС_НастройкиAPIПараметрыЗапроса.ТипПараметра КАК ТипПараметра,
	|	МС_НастройкиAPIПараметрыЗапроса.Описание КАК Описание,
	|	МС_НастройкиAPIПараметрыЗапроса.СпособСопоставления КАК СпособСопоставления
	|ИЗ
	|	Справочник.МС_НастройкиAPI.ПараметрыЗапроса КАК МС_НастройкиAPIПараметрыЗапроса
	|ГДЕ
	|	МС_НастройкиAPIПараметрыЗапроса.Ссылка = &Ссылка";
	ЗапросПЗ.УстановитьПараметр("Ссылка", СсылкаНастройки);
	Данные.Вставить("ПараметрыЗапроса", ЗапросПЗ.Выполнить().Выгрузить());
	
	ЗапросТест = Новый Запрос;
	ЗапросТест.Текст =
	"ВЫБРАТЬ
	|	МС_НастройкиAPIТестовыеЗначенияПараметров.ИмяПараметра КАК ИмяПараметра,
	|	МС_НастройкиAPIТестовыеЗначенияПараметров.Значение КАК Значение
	|ИЗ
	|	Справочник.МС_НастройкиAPI.ТестовыеЗначенияПараметров КАК МС_НастройкиAPIТестовыеЗначенияПараметров
	|ГДЕ
	|	МС_НастройкиAPIТестовыеЗначенияПараметров.Ссылка = &Ссылка";
	ЗапросТест.УстановитьПараметр("Ссылка", СсылкаНастройки);
	Данные.Вставить("ТестовыеЗначенияПараметров", ЗапросТест.Выполнить().Выгрузить());
	
	Возврат Данные;
	
КонецФункции

// Собирает параметры API: строка запроса (все методы), тело JSON-объекта, тело application/x-www-form-urlencoded.
//
Функция СобратьПараметрыИзHTTPЗапроса(Запрос)
	
	Результат = Новый Соответствие;
	ПЗ = Запрос.ПараметрыЗапроса;
	Если ПЗ <> Неопределено Тогда
		Для Каждого ПараметрЗапроса Из ПЗ Цикл
			Результат.Вставить(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
		КонецЦикла;
	КонецЕсли;
	
	ТелоСтрока = Запрос.ПолучитьТелоКакСтроку();
	Если Не ЗначениеЗаполнено(ТелоСтрока) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		ДанныеТела = JSONВЗначение(ТелоСтрока);
		Если ТипЗнч(ДанныеТела) = Тип("Соответствие") Или ТипЗнч(ДанныеТела) = Тип("Структура") Тогда
			Для Каждого КлючЗначение Из ДанныеТела Цикл
				Результат.Вставить(Строка(КлючЗначение.Ключ), КлючЗначение.Значение);
			КонецЦикла;
			Возврат Результат;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	ДобавитьПараметрыИзСтрокиКакFormUrlEncoded(ТелоСтрока, Результат);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьОбязательныеПараметры(ДанныеНастройки, ПараметрыВнешние)
	
	Для Каждого СтрокаПараметра Из ДанныеНастройки.ПараметрыЗапроса Цикл
		Если Не СтрокаПараметра.Обязательный Тогда
			Продолжить;
		КонецЕсли;
		ЗначениеП = ПараметрыВнешние.Получить(СтрокаПараметра.ИмяПараметра);
		Если ЗначениеП = Неопределено Или Не ЗначениеЗаполнено(ЗначениеП) Тогда
			ВызватьИсключение "Не передан обязательный параметр: " + СтрокаПараметра.ИмяПараметра;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПараметрыДляТестаПоДаннымНастройки(ДанныеНастройки)
	
	Результат = Новый Соответствие;
	ТипыПоИмени = Новый Соответствие;
	Для Каждого СтрП Из ДанныеНастройки.ПараметрыЗапроса Цикл
		Имя = СокрЛП(СтрП.ИмяПараметра);
		Если ЗначениеЗаполнено(Имя) Тогда
			ТипыПоИмени.Вставить(Имя, СтрП.ТипПараметра);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрТ Из ДанныеНастройки.ТестовыеЗначенияПараметров Цикл
		Имя = СокрЛП(СтрТ.ИмяПараметра);
		Если Не ЗначениеЗаполнено(Имя) Тогда
			Продолжить;
		КонецЕсли;
		ТипП = ТипыПоИмени.Получить(Имя);
		Если ДанныеНастройки.СпособПолученияДанных = Перечисления.МС_СпособПолученияДанныхAPI.Конструктор Тогда
			СтрокаП = НайтиСтрокуПараметраЗапросаПоИмени(ДанныеНастройки.ПараметрыЗапроса, Имя);
			ПолеОтбора = ПолеОтбораИзОписанияОтбораПараметра(?(СтрокаП = Неопределено, "", СтрокаП.Описание));
			Если ЗначениеЗаполнено(ПолеОтбора) И ЗначениеЗаполнено(ДанныеНастройки.КонструкторИмяТаблицы) Тогда
				ОТ = МС_HTTPAPIКонструкторСервер.ПолучитьОписаниеТипаПоляТаблицы(ДанныеНастройки.КонструкторИмяТаблицы, ПолеОтбора);
				Способ = ?(СтрокаП = Неопределено, Неопределено, СтрокаП.СпособСопоставления);
				Результат.Вставить(Имя, МС_HTTPAPIКонструкторСервер.ЗначениеИзСтрокиПоОписаниюТиповИСпособу(ОТ, СтрТ.Значение, Способ));
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Результат.Вставить(Имя, ПреобразоватьТестовоеЗначениеПараметра(СтрТ.Значение, ТипП));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПреобразоватьТестовоеЗначениеПараметра(Знач СтрокаЗначения, ТипПараметраСтрока)
	
	Если Не ЗначениеЗаполнено(СтрокаЗначения) Тогда
		Возврат "";
	КонецЕсли;
	
	ТипС = ?(ЗначениеЗаполнено(ТипПараметраСтрока), ВРег(СокрЛП(Строка(ТипПараметраСтрока))), "");
	
	Если ТипС = "ЧИСЛО" Или ТипС = "NUMBER" Тогда
		Попытка
			Возврат Число(СтрокаЗначения);
		Исключение
			Возврат 0;
		КонецПопытки;
	ИначеЕсли ТипС = "БУЛЕВО" Или ТипС = "BOOLEAN" Тогда
		НС = ВРег(СокрЛП(СтрокаЗначения));
		Возврат НС = "ИСТИНА" Или НС = "TRUE" Или НС = "ДА" Или НС = "1";
	ИначеЕсли ТипС = "ДАТА" Или ТипС = "DATE" Тогда
		Попытка
			Возврат XMLЗначение(Тип("Дата"), СтрокаЗначения);
		Исключение
			Возврат СтрокаЗначения;
		КонецПопытки;
	Иначе
		Возврат СтрокаЗначения;
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьПараметрыИзСтрокиКакFormUrlEncoded(Знач ТелоСтрока, Результат)
	
	Если СтрНайти(ТелоСтрока, "=") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Фрагменты = СтрРазделить(ТелоСтрока, "&", Ложь);
	Для Каждого Фрагмент Из Фрагменты Цикл
		Поз = СтрНайти(Фрагмент, "=");
		Если Поз = 0 Тогда
			Продолжить;
		КонецЕсли;
		Имя = Лев(Фрагмент, Поз - 1);
		Значение = Сред(Фрагмент, Поз + 1);
		Имя = РаскодироватьСтрокуДляHTTP(Имя);
		Значение = РаскодироватьСтрокуДляHTTP(Значение);
		Если ЗначениеЗаполнено(Имя) Тогда
			Результат.Вставить(Имя, Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция РаскодироватьСтрокуДляHTTP(Знач S)
	
	Попытка
		Возврат РаскодироватьСтроку(S, СпособКодированияСтроки.КодировкаURL);
	Исключение
		Возврат S;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьДанныеПоНастройке(ДанныеНастройки, ПараметрыВнешние, ХвостПути, ПараметрыЗапросаСтроки)
	
	Способ = ДанныеНастройки.СпособПолученияДанных;
	
	Если Способ = Перечисления.МС_СпособПолученияДанныхAPI.ТекстЗапроса Тогда
		Возврат ВыполнитьТекстЗапроса(ДанныеНастройки, ПараметрыВнешние);
	ИначеЕсли Способ = Перечисления.МС_СпособПолученияДанныхAPI.ПрограммныйМодуль Тогда
		Возврат МС_HTTPAPIПользовательскиеОбработчики.ВыполнитьОбработчик(ДанныеНастройки.ИмяМетодаОбработчика, Новый Структура("Параметры,ХвостПути", ПараметрыВнешние, ХвостПути));
	ИначеЕсли Способ = Перечисления.МС_СпособПолученияДанныхAPI.Конструктор Тогда
		Возврат ВыполнитьКонструктор(ДанныеНастройки, ПараметрыВнешние);
	Иначе
		ВызватьИсключение "Не указан способ получения данных";
	КонецЕсли;
	
КонецФункции

Функция ВыполнитьТекстЗапроса(ДанныеНастройки, ПараметрыВнешние)
	
	Если Не ЗначениеЗаполнено(ДанныеНастройки.ТекстЗапроса) Тогда
		ВызватьИсключение "Пустой текст запроса";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ДанныеНастройки.ТекстЗапроса;
	Для Каждого КлючЗначение Из ПараметрыВнешние Цикл
		Попытка
			Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
		Исключение
		КонецПопытки;
	КонецЦикла;
	Запрос.УстановитьПараметр("ЛимитСтрок", ДанныеНастройки.ЛимитСтрок);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
	
КонецФункции

Функция ВыполнитьКонструктор(ДанныеНастройки, ПараметрыВнешние)
	
	ИмяТаблицы = СокрЛП(ДанныеНастройки.КонструкторИмяТаблицы);
	Если Не ЗначениеЗаполнено(ИмяТаблицы) Тогда
		ВызватьИсключение "Не указано имя таблицы конструктора";
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	Если ОбъектМетаданных = Неопределено Тогда
		ВызватьИсключение "Объект метаданных не найден: " + ИмяТаблицы;
	КонецЕсли;
	
	ПоляМассив = Новый Массив;
	Если ЗначениеЗаполнено(ДанныеНастройки.КонструкторПоля) Тогда
		Попытка
			Прочитанное = JSONВЗначение(ДанныеНастройки.КонструкторПоля);
			Если ТипЗнч(Прочитанное) = Тип("Массив") Тогда
				Для Каждого Элемент Из Прочитанное Цикл
					ПоляМассив.Добавить(Строка(Элемент));
				КонецЦикла;
			КонецЕсли;
		Исключение
			// как строка через запятую
			Части = СтрРазделить(ДанныеНастройки.КонструкторПоля, ",", Ложь);
			Для Каждого Часть Из Части Цикл
				ПоляМассив.Добавить(СокрЛП(Часть));
			КонецЦикла;
		КонецПопытки;
	КонецЕсли;
	
	Если ПоляМассив.Количество() = 0 Тогда
		ПоляМассив.Добавить("Ссылка");
	КонецЕсли;
	
	Псевдоним = "Т";
	СписокПолей = "";
	Для Каждого ИмяПоля Из ПоляМассив Цикл
		СписокПолей = СписокПолей + ?(ЗначениеЗаполнено(СписокПолей), ", ", "") + Псевдоним + "." + ИмяПоля + " КАК " + ИмяПоля;
	КонецЦикла;
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ " + Формат(ДанныеНастройки.ЛимитСтрок, "ЧГ=0") + "
	|" + СписокПолей + "
	|ИЗ
	|" + ИмяТаблицы + " КАК " + Псевдоним;
	
	Условия = Новый Массив;
	ЗначенияПараметровОтбора = Новый Массив;
	Если ЗначениеЗаполнено(ДанныеНастройки.КонструкторОтборыJSON) Тогда
		Попытка
			Отборы = JSONВЗначение(ДанныеНастройки.КонструкторОтборыJSON);
			Если ТипЗнч(Отборы) = Тип("Массив") Тогда
				Номер = 0;
				Для Каждого ЭлементОтбора Из Отборы Цикл
					Если ТипЗнч(ЭлементОтбора) <> Тип("Соответствие") И ТипЗнч(ЭлементОтбора) <> Тип("Структура") Тогда
						Продолжить;
					КонецЕсли;
					ПолеОтбора = ЗначениеКлючаJSON(ЭлементОтбора, "Поле");
					Если Не ЗначениеЗаполнено(ПолеОтбора) Тогда
						Продолжить;
					КонецЕсли;
					Сравнение = ЗначениеКлючаJSON(ЭлементОтбора, "Сравнение");
					Если Не ЗначениеЗаполнено(Сравнение) Тогда
						Сравнение = "=";
					КонецЕсли;
					ИмяПараметраОтбора = ЗначениеКлючаJSON(ЭлементОтбора, "ИмяПараметра");
					ЕстьЗначениеВнутр = ЗначениеКлючаJSON(ЭлементОтбора, "ЗначениеВнутр") <> Неопределено;
					ЕстьЗначениеСтарое = ЗначениеКлючаJSON(ЭлементОтбора, "Значение") <> Неопределено;
					Если Не ЗначениеЗаполнено(ИмяПараметраОтбора) И Не ЕстьЗначениеВнутр И Не ЕстьЗначениеСтарое Тогда
						Продолжить;
					КонецЕсли;
					Номер = Номер + 1;
					Условия.Добавить(Псевдоним + "." + ПолеОтбора + " " + Сравнение + " &П" + Формат(Номер, "ЧГ=0"));
					ЗначениеП = Неопределено;
					Если ЗначениеЗаполнено(ИмяПараметраОтбора) Тогда
						Сырое = ПараметрыВнешние.Получить(ИмяПараметраОтбора);
						СтрокаП = НайтиСтрокуПараметраЗапросаПоИмени(ДанныеНастройки.ПараметрыЗапроса, СокрЛП(Строка(ИмяПараметраОтбора)));
						ТипПСтрока = ?(СтрокаП = Неопределено, "", СтрокаП.ТипПараметра);
						СпособС = ?(СтрокаП = Неопределено, Неопределено, СтрокаП.СпособСопоставления);
						ЗначениеП = МС_HTTPAPIКонструкторСервер.ПривестиСыроеЗначениеПараметраОтбораКТипуПоля(ИмяТаблицы, Строка(ПолеОтбора), Сырое, ТипПСтрока, СпособС);
					ИначеЕсли ЕстьЗначениеВнутр Тогда
						Попытка
							ЗначениеП = ЗначениеИзСтрокиВнутр(Строка(ЗначениеКлючаJSON(ЭлементОтбора, "ЗначениеВнутр")));
						Исключение
							ЗначениеП = Неопределено;
						КонецПопытки;
					Иначе
						ОТ = МС_HTTPAPIКонструкторСервер.ПолучитьОписаниеТипаПоляТаблицы(ИмяТаблицы, Строка(ПолеОтбора));
						ЗначениеП = МС_HTTPAPIКонструкторСервер.ЗначениеИзСтрокиПоОписаниюТипов(ОТ, Строка(ЗначениеКлючаJSON(ЭлементОтбора, "Значение")));
					КонецЕсли;
					ЗначенияПараметровОтбора.Добавить(ЗначениеП);
				КонецЦикла;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если Условия.Количество() > 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ
		|" + СтрСоединить(Условия, "
		|	И ");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Для Инд = 1 По ЗначенияПараметровОтбора.Количество() Цикл
		Запрос.УстановитьПараметр("П" + Формат(Инд, "ЧГ=0"), ЗначенияПараметровОтбора[Инд - 1]);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
	
КонецФункции

Функция РезультатЗапросаВМассивСтруктур(Знач РезультатЗапроса)
	
	Выборка = РезультатЗапроса.Выбрать();
	МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураЭлемента = Новый Структура;
		Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
			
			Если ТипЗнч(Выборка[Колонка.Имя]) = Тип("РезультатЗапроса") Тогда
				МассивВложенный = РезультатЗапросаВМассивСтруктур(Выборка[Колонка.Имя]);
				СтруктураЭлемента.Вставить(Колонка.Имя, МассивВложенный);
			Иначе
				СтруктураЭлемента.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
			КонецЕсли;
			
		КонецЦикла;
		
		МассивЭлементов.Добавить(СтруктураЭлемента);
		
	КонецЦикла;
	
	Возврат МассивЭлементов;
	
КонецФункции

Функция СериализоватьДанные(ДанныеНастройки, Данные)
	
	Корень = Новый Структура;
	Корень.Вставить("apiVersion", ДанныеНастройки.ВерсияAPI);
	Корень.Вставить("data", Данные);
	
	Если ДанныеНастройки.ФорматОтвета = Перечисления.МС_ФорматОтветаAPI.JSON Тогда
		ПараметрыЗаписи = ПараметрыЗаписиJSONИзНастройки(ДанныеНастройки);
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
		СформироватьЗаписьJSON(ЗаписьJSON, Корень);
		//ЗаписатьJSON(ЗаписьJSON, Корень);
		Возврат ЗаписьJSON.Закрыть();
	Иначе
		Возврат УпрощенныйXMLИзСтруктуры(Корень);
	КонецЕсли;
	
КонецФункции

// Рекурсивная процедура преобразующая структуру в текст Json
//
// Параметры:
//  ЗаписьJSON       - ЗаписьJSON - объект записи JSON-текста
//  ДанныеДляЗаписи  - Структура, Соответствие, Массив или примитивные типы
//
Процедура СформироватьЗаписьJSON(ЗаписьJSON, ДанныеДляЗаписи)
	
	ТипДанных = ТипЗнч(ДанныеДляЗаписи);
	
	Если ТипДанных = Тип("Структура") Или ТипДанных = Тип("Соответствие") Тогда
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		Для Каждого ЭлементСтруктуры Из ДанныеДляЗаписи Цикл
			ЗаписьJSON.ЗаписатьИмяСвойства(ЭлементСтруктуры.Ключ);
			ЗаписатьЗначениеДляJSON(ЗаписьJSON, ЭлементСтруктуры.Значение);
		КонецЦикла;
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
	ИначеЕсли ТипДанных = Тип("Массив") Тогда
		
		ЗаписьJSON.ЗаписатьНачалоМассива();
		Для Каждого ЭлементМассива Из ДанныеДляЗаписи Цикл
			ЗаписатьЗначениеДляJSON(ЗаписьJSON, ЭлементМассива);
		КонецЦикла;
		ЗаписьJSON.ЗаписатьКонецМассива();
		
	КонецЕсли;
	
КонецПроцедуры

// Экранирует строку под ручную передачу в ЗаписьJSON.ЗаписатьЗначение (дополнительно к настройкам ПараметрыЗаписиJSON).
//
Функция ЭкранироватьСтрокуДляЗаписиJSON(Знач Строка)
	
	Результат = СтрЗаменить(Строка, "\", "\\");
	Результат = СтрЗаменить(Результат, Символы.ПС, "\n");
	Результат = СтрЗаменить(Результат, Символы.ВК, "\r");
	Результат = СтрЗаменить(Результат, "/", "\/");
	Результат = СтрЗаменить(Результат, "'", "\'");
	Результат = СтрЗаменить(Результат, """", "\""");
	Возврат Результат;
	
КонецФункции

// Записывает одно JSON-значение (без имени свойства): примитивы, вложенные объекты/массивы, NULL, прочие типы как строка.
//
Процедура ЗаписатьЗначениеДляJSON(ЗаписьJSON, Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Строка") Тогда
		ЗаписьJSON.ЗаписатьЗначение(ЭкранироватьСтрокуДляЗаписиJSON(Значение));
	ИначеЕсли ТипЗначения = Тип("Число")
		Или ТипЗначения = Тип("Булево")
		Или ТипЗначения = Неопределено Тогда
		ЗаписьJSON.ЗаписатьЗначение(Значение);
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		ЗаписьJSON.ЗаписатьЗначение(Формат(Значение - Дата(1970, 1, 1, 1, 0, 0), "ЧГ=0"));
	ИначеЕсли ТипЗначения = Тип("Структура")
		Или ТипЗначения = Тип("Массив")
		Или ТипЗначения = Тип("Соответствие") Тогда
		СформироватьЗаписьJSON(ЗаписьJSON, Значение);
	ИначеЕсли Значение = NULL Тогда
		ЗаписьJSON.ЗаписатьЗначение(Неопределено);
	Иначе
		ЗаписьJSON.ЗаписатьЗначение(ЭкранироватьСтрокуДляЗаписиJSON(Строка(Значение)));
	КонецЕсли;
	
КонецПроцедуры

Функция СоответствиеНастроекЗаписиJSONСлитьСПоУмолчанию(Знач Пользовательское)
	
	Деф = JSONВЗначение(СтрокаПараметровЗаписиJSONПоУмолчанию());
	Итог = Новый Соответствие;
	Если ТипЗнч(Деф) = Тип("Структура") Тогда
		Для Каждого К Из Деф Цикл
			Итог.Вставить(К.Ключ, К.Значение);
		КонецЦикла;
	ИначеЕсли ТипЗнч(Деф) = Тип("Соответствие") Тогда
		Для Каждого К Из Деф Цикл
			Итог.Вставить(К.Ключ, К.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если ТипЗнч(Пользовательское) = Тип("Структура") Или ТипЗнч(Пользовательское) = Тип("Соответствие") Тогда
		Для Каждого К Из Пользовательское Цикл
			Итог.Вставить(К.Ключ, К.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Итог;
	
КонецФункции

Функция ПараметрыЗаписиJSONИзСоответствияНастроек(Соотв)
	
	Перенос = ПереносСтрокJSON.Авто;
	Если ЗначениеКлючаJSON(Соотв, "ПереносСтрок") <> Неопределено Тогда
		СтрП = ВРег(Строка(ЗначениеКлючаJSON(Соотв, "ПереносСтрок")));
		Если СтрП = "НЕТ" Тогда
			Перенос = ПереносСтрокJSON.Нет;
		ИначеЕсли СтрП = "UNIX" Тогда
			Перенос = ПереносСтрокJSON.Unix;
		ИначеЕсли СтрП = "WINDOWS" Тогда
			Перенос = ПереносСтрокJSON.Windows;
		ИначеЕсли СтрП = "АВТО" Тогда
			Перенос = ПереносСтрокJSON.Авто;
		КонецЕсли;
	КонецЕсли;
	
	СимволыОтступа = "";
	Если ЗначениеКлючаJSON(Соотв, "СимволыОтступа") <> Неопределено Тогда
		СимволыОтступа = Строка(ЗначениеКлючаJSON(Соотв, "СимволыОтступа"));
	КонецЕсли;
	
	ДвойныеКавычки = Истина;
	Если ЗначениеКлючаJSON(Соотв, "ИспользоватьДвойныеКавычки") <> Неопределено Тогда
		ЗначДк = ЗначениеКлючаJSON(Соотв, "ИспользоватьДвойныеКавычки");
		ДвойныеКавычки = ?(ТипЗнч(ЗначДк) = Тип("Булево"), ЗначДк, Истина);
	КонецЕсли;
	
	Экран = ЭкранированиеСимволовJSON.Нет;
	Если ЗначениеКлючаJSON(Соотв, "ЭкранированиеСимволов") <> Неопределено Тогда
		СтрЭ = Строка(ЗначениеКлючаJSON(Соотв, "ЭкранированиеСимволов"));
		Если ВРег(СтрЭ) = "НЕТ" Тогда
			Экран = ЭкранированиеСимволовJSON.Нет;
		КонецЕсли;
	КонецЕсли;
	
	ЭкрУглы = Истина;
	ЭкрРазделитель = Истина;
	ЭкрАмп = Истина;
	ЭкрОдн = Истина;
	ЭкрКав = Истина;
	Если ЗначениеКлючаJSON(Соотв, "ЭкранироватьУгловыеСкобки") <> Неопределено Тогда
		Зн = ЗначениеКлючаJSON(Соотв, "ЭкранироватьУгловыеСкобки");
		ЭкрУглы = ?(ТипЗнч(Зн) = Тип("Булево"), Зн, Истина);
	КонецЕсли;
	Если ЗначениеКлючаJSON(Соотв, "ЭкранироватьРазделительСтрок") <> Неопределено Тогда
		Зн = ЗначениеКлючаJSON(Соотв, "ЭкранироватьРазделительСтрок");
		ЭкрРазделитель = ?(ТипЗнч(Зн) = Тип("Булево"), Зн, Истина);
	КонецЕсли;
	Если ЗначениеКлючаJSON(Соотв, "ЭкранироватьАмперсанд") <> Неопределено Тогда
		Зн = ЗначениеКлючаJSON(Соотв, "ЭкранироватьАмперсанд");
		ЭкрАмп = ?(ТипЗнч(Зн) = Тип("Булево"), Зн, Истина);
	КонецЕсли;
	Если ЗначениеКлючаJSON(Соотв, "ЭкранироватьОдинарныеКавычки") <> Неопределено Тогда
		Зн = ЗначениеКлючаJSON(Соотв, "ЭкранироватьОдинарныеКавычки");
		ЭкрОдн = ?(ТипЗнч(Зн) = Тип("Булево"), Зн, Истина);
	КонецЕсли;
	Если ЗначениеКлючаJSON(Соотв, "ЭкранироватьКавычки") <> Неопределено Тогда
		Зн = ЗначениеКлючаJSON(Соотв, "ЭкранироватьКавычки");
		ЭкрКав = ?(ТипЗнч(Зн) = Тип("Булево"), Зн, Истина);
	КонецЕсли;
	
	Возврат Новый ПараметрыЗаписиJSON(Перенос, СимволыОтступа, ДвойныеКавычки, Экран, ЭкрУглы, ЭкрРазделитель, ЭкрАмп, ЭкрОдн, ЭкрКав);
	
КонецФункции

Функция ПараметрыЗаписиJSONИзНастройки(ДанныеНастройки)
	
	СтрокаНастроек = ДанныеНастройки.JSONПараметрыЗаписи;
	Если Не ЗначениеЗаполнено(СтрокаНастроек) Тогда
		СтрокаНастроек = СтрокаПараметровЗаписиJSONПоУмолчанию();
	КонецЕсли;
	
	Попытка
		СоотвПользов = JSONВЗначение(СтрокаНастроек);
	Исключение
		СоотвПользов = Новый Соответствие;
	КонецПопытки;
	Если ТипЗнч(СоотвПользов) <> Тип("Соответствие") И ТипЗнч(СоотвПользов) <> Тип("Структура") Тогда
		СоотвПользов = Новый Структура;
	КонецЕсли;
	
	Соотв = СоответствиеНастроекЗаписиJSONСлитьСПоУмолчанию(СоотвПользов);
	Возврат ПараметрыЗаписиJSONИзСоответствияНастроек(Соотв);
	
КонецФункции

// Разбор сохранённой строки JSON в структуру для реквизитов формы (ключи как в JSON).
//
Функция НастройкиЗаписиJSONВСтруктуруФормы(СтрокаJSON) Экспорт
	
	Пользов = Неопределено;
	Если ЗначениеЗаполнено(СтрокаJSON) Тогда
		Попытка
			Пользов = JSONВЗначение(СтрокаJSON);
		Исключение
			Пользов = Неопределено;
		КонецПопытки;
	КонецЕсли;
	Если ТипЗнч(Пользов) <> Тип("Соответствие") И ТипЗнч(Пользов) <> Тип("Структура") Тогда
		Пользов = Новый Структура;
	КонецЕсли;
	
	Итог = СоответствиеНастроекЗаписиJSONСлитьСПоУмолчанию(Пользов);
	
	ЗнБул = ЗначениеКлючаJSON(Итог, "ИспользоватьДвойныеКавычки");
	ДвойныеКавычки = ?(ТипЗнч(ЗнБул) = Тип("Булево"), ЗнБул, Истина);
	
	Рез = Новый Структура;
	Рез.Вставить("ПереносСтрок", Строка(ЗначениеКлючаJSON(Итог, "ПереносСтрок")));
	Рез.Вставить("СимволыОтступа", Строка(ЗначениеКлючаJSON(Итог, "СимволыОтступа")));
	Рез.Вставить("ИспользоватьДвойныеКавычки", ДвойныеКавычки);
	Рез.Вставить("ЭкранированиеСимволов", Строка(ЗначениеКлючаJSON(Итог, "ЭкранированиеСимволов")));
	
	Зн = ЗначениеКлючаJSON(Итог, "ЭкранироватьУгловыеСкобки");
	Рез.Вставить("ЭкранироватьУгловыеСкобки", ?(ТипЗнч(Зн) = Тип("Булево"), Зн, Истина));
	Зн = ЗначениеКлючаJSON(Итог, "ЭкранироватьРазделительСтрок");
	Рез.Вставить("ЭкранироватьРазделительСтрок", ?(ТипЗнч(Зн) = Тип("Булево"), Зн, Истина));
	Зн = ЗначениеКлючаJSON(Итог, "ЭкранироватьАмперсанд");
	Рез.Вставить("ЭкранироватьАмперсанд", ?(ТипЗнч(Зн) = Тип("Булево"), Зн, Истина));
	Зн = ЗначениеКлючаJSON(Итог, "ЭкранироватьОдинарныеКавычки");
	Рез.Вставить("ЭкранироватьОдинарныеКавычки", ?(ТипЗнч(Зн) = Тип("Булево"), Зн, Истина));
	Зн = ЗначениеКлючаJSON(Итог, "ЭкранироватьКавычки");
	Рез.Вставить("ЭкранироватьКавычки", ?(ТипЗнч(Зн) = Тип("Булево"), Зн, Истина));
	
	Возврат Рез;
	
КонецФункции

// Сборка строки для реквизита JSONПараметрыЗаписи из структуры формы (те же ключи, что в JSON).
//
Функция СтрокаНастроекЗаписиJSONИзСтруктурыФормы(СтруктураНастроек) Экспорт
	
	Корень = Новый Структура;
	Корень.Вставить("ПереносСтрок", СтруктураНастроек.ПереносСтрок);
	Корень.Вставить("СимволыОтступа", СтруктураНастроек.СимволыОтступа);
	Корень.Вставить("ИспользоватьДвойныеКавычки", СтруктураНастроек.ИспользоватьДвойныеКавычки);
	Корень.Вставить("ЭкранированиеСимволов", СтруктураНастроек.ЭкранированиеСимволов);
	Корень.Вставить("ЭкранироватьУгловыеСкобки", СтруктураНастроек.ЭкранироватьУгловыеСкобки);
	Корень.Вставить("ЭкранироватьРазделительСтрок", СтруктураНастроек.ЭкранироватьРазделительСтрок);
	Корень.Вставить("ЭкранироватьАмперсанд", СтруктураНастроек.ЭкранироватьАмперсанд);
	Корень.Вставить("ЭкранироватьОдинарныеКавычки", СтруктураНастроек.ЭкранироватьОдинарныеКавычки);
	Корень.Вставить("ЭкранироватьКавычки", СтруктураНастроек.ЭкранироватьКавычки);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Корень);
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция УпрощенныйXMLИзСтруктуры(Значение)
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписатьУзелXML(ЗаписьXML, "root", Значение);
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

Процедура ЗаписатьУзелXML(ЗаписьXML, Имя, Значение)
	
	Если ТипЗнч(Значение) = Тип("Структура") Или ТипЗнч(Значение) = Тип("Соответствие") Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента(Имя);
		Для Каждого КлючЗначение Из Значение Цикл
			ЗаписатьУзелXML(ЗаписьXML, Строка(КлючЗначение.Ключ), КлючЗначение.Значение);
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	ИначеЕсли ТипЗнч(Значение) = Тип("Массив") Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента(Имя);
		Для Каждого Элемент Из Значение Цикл
			ЗаписатьУзелXML(ЗаписьXML, "item", Элемент);
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	Иначе
		ЗаписьXML.ЗаписатьНачалоЭлемента(Имя);
		ЗаписьXML.ЗаписатьТекст(Строка(Значение));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьЗаголовкиОтвета(Ответ, ДанныеНастройки)
	
	Если ДанныеНастройки.ФорматОтвета = Перечисления.МС_ФорматОтветаAPI.JSON Тогда
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Иначе
		Ответ.Заголовки.Вставить("Content-Type", "application/xml; charset=utf-8");
	КонецЕсли;
	Ответ.Заголовки.Вставить("API-Version", ДанныеНастройки.ВерсияAPI);
	
КонецПроцедуры

Функция СтрокаПараметровЗаписиJSONПоУмолчанию()
	
	Возврат "{""ПереносСтрок"":""Авто"",""СимволыОтступа"":"""",""ИспользоватьДвойныеКавычки"":true,""ЭкранированиеСимволов"":""Нет"",""ЭкранироватьУгловыеСкобки"":true,""ЭкранироватьРазделительСтрок"":true,""ЭкранироватьАмперсанд"":true,""ЭкранироватьОдинарныеКавычки"":true,""ЭкранироватьКавычки"":true}";
	
КонецФункции

Функция ОтветОшибкиСервиса(КодHTTP, ТекстОшибки, ФорматОтветаПеречисление, ВерсияAPIСтрока)
	
	СтруктураОшибки = Новый Структура;
	СтруктураОшибки.Вставить("error", Новый Структура("code, message", Строка(КодHTTP), ТекстОшибки));
	СтруктураОшибки.Вставить("apiVersion", ВерсияAPIСтрока);
	Тело = "";
	Если ФорматОтветаПеречисление = Перечисления.МС_ФорматОтветаAPI.XML Тогда
		Тело = УпрощенныйXMLИзСтруктуры(СтруктураОшибки);
	Иначе
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтруктураОшибки);
		Тело = ЗаписьJSON.Закрыть();
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(КодHTTP);
	Ответ.УстановитьТелоИзСтроки(Тело, КодировкаТекста.UTF8);
	Если ФорматОтветаПеречисление = Перечисления.МС_ФорматОтветаAPI.XML Тогда
		Ответ.Заголовки.Вставить("Content-Type", "application/xml; charset=utf-8");
	Иначе
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция JSONВЗначение(СтрокаJSON)
	
	Если Не ЗначениеЗаполнено(СтрокаJSON) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Возврат ПрочитатьJSON(ЧтениеJSON);
	
КонецФункции

Функция НайтиСтрокуПараметраЗапросаПоИмени(ПараметрыЗапроса, Имя)
	
	Для Каждого Стр Из ПараметрыЗапроса Цикл
		Если СокрЛП(Стр.ИмяПараметра) = Имя Тогда
			Возврат Стр;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
	
КонецФункции

Функция ПолеОтбораИзОписанияОтбораПараметра(Описание)
	
	Если Не ЗначениеЗаполнено(Описание) Тогда
		Возврат "";
	КонецЕсли;
	С = СокрЛП(Описание);
	Если СтрНачинаетсяС(ВРег(С), ВРег("Отбор:")) Тогда
		Поз = СтрНайти(С, ":");
		Если Поз > 0 Тогда
			Возврат СокрЛП(Сред(С, Поз + 1));
		КонецЕсли;
	КонецЕсли;
	Возврат "";
	
КонецФункции

#КонецОбласти
